# Pandas

In [5]:
import pandas as pd

In [18]:
tables = pd.read_html("https://www.w3schools.com/html/html_tables.asp")

In [19]:
type(tables[0])

pandas.core.frame.DataFrame

In [20]:
table = tables[0]

In [22]:
table

                        Company           Contact  Country
0           Alfreds Futterkiste      Maria Anders  Germany
1    Centro comercial Moctezuma   Francisco Chang   Mexico
2                  Ernst Handel     Roland Mendel  Austria
3                Island Trading     Helen Bennett       UK
4  Laughing Bacchus Winecellars   Yoshi Tannamuri   Canada
5  Magazzini Alimentari Riuniti  Giovanni Rovelli    Italy

In [25]:
table.to_excel("info.xlsx")

In [26]:
names = ["Vishal", "Ayushi", "Ishika", "Abhi"]

In [27]:
ages = [19, 20, 22, 25]

In [30]:
s_names = pd.Series(names)
s_ages = pd.Series(ages)

In [34]:
pd.DataFrame([s_names, s_ages]).T

        0   1
0  Vishal  19
1  Ayushi  20
2  Ishika  22
3    Abhi  25

In [36]:
pd.DataFrame({"name":s_names, "ages":s_ages})

     name  ages
0  Vishal    19
1  Ayushi    20
2  Ishika    22
3    Abhi    25

## or

In [48]:
d = list(zip(names, ages))

In [49]:
pd.DataFrame(d,columns=["names", "ages"])

    names  ages
0  Vishal    19
1  Ayushi    20
2  Ishika    22
3    Abhi    25

## or

In [41]:
names = ["Vishal", "Ayushi", "Ishika", "Abhi"]
ages = [19, 20, 22, 25]
val = ["M", "F", "F", "M"]

In [42]:
data = {}
data["names"] = names
data["ages"] = ages
data["values"] = val
pd.DataFrame(data)

    names  ages values
0  Vishal    19      M
1  Ayushi    20      F
2  Ishika    22      F
3    Abhi    25      M

In [44]:
import numpy as np

In [46]:
data = np.random.randint(10, 20, (10,5))

In [50]:
pd.DataFrame(data, columns=list("ABCDE"))

    A   B   C   D   E
0  11  13  19  18  13
1  16  13  12  18  15
2  16  14  19  19  16
3  16  10  10  19  14
4  14  17  14  17  14
5  11  14  14  10  14
6  15  17  17  15  11
7  16  17  11  13  12
8  10  10  18  16  12
9  15  13  14  18  14

In [51]:
d = pd.DataFrame(data, columns=list("ABCDE"))

In [53]:
d.A

0    11
1    16
2    16
3    16
4    14
5    11
6    15
7    16
8    10
9    15
Name: A, dtype: int32

In [57]:
d["F"] = 0

In [58]:
d

    A   B   C   D   E  F
0  11  13  19  18  13  0
1  16  13  12  18  15  0
2  16  14  19  19  16  0
3  16  10  10  19  14  0
4  14  17  14  17  14  0
5  11  14  14  10  14  0
6  15  17  17  15  11  0
7  16  17  11  13  12  0
8  10  10  18  16  12  0
9  15  13  14  18  14  0

In [62]:
d["G"] = range(50, 70, 2)

In [63]:
d

    A   B   C   D   E  F   G
0  11  13  19  18  13  0  50
1  16  13  12  18  15  0  52
2  16  14  19  19  16  0  54
3  16  10  10  19  14  0  56
4  14  17  14  17  14  0  58
5  11  14  14  10  14  0  60
6  15  17  17  15  11  0  62
7  16  17  11  13  12  0  64
8  10  10  18  16  12  0  66
9  15  13  14  18  14  0  68

In [70]:
dates = pd.date_range('20130101', periods=6, freq="D")

In [71]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

- By choosing freq as Y, M , D the change will occur accordingly as dates, months or year

In [76]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns = list("ABCD"))

In [77]:
df

                   A         B         C         D
2013-01-01 -2.404156  1.974372 -2.350369 -1.204461
2013-01-02  0.526254  0.478843 -1.939512 -1.183173
2013-01-03  2.854547  0.131653  1.891560  0.294057
2013-01-04 -0.570920 -0.198467 -0.398307  0.798823
2013-01-05 -0.396819  0.497456  0.047523 -0.928408
2013-01-06  0.818414 -0.113912  0.994635 -0.317653

In [78]:
df2 = pd.DataFrame({'A': 1.,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3] * 4, dtype='int32'),
                    'E': pd.Categorical(["test", "train", "test", "train"]),
                    'F': 'foo'})

In [80]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [81]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [82]:
df2.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [83]:
df2.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [85]:
df2.describe()

         A    C    D
count  4.0  4.0  4.0
mean   1.0  1.0  3.0
std    0.0  0.0  0.0
min    1.0  1.0  3.0
25%    1.0  1.0  3.0
50%    1.0  1.0  3.0
75%    1.0  1.0  3.0
max    1.0  1.0  3.0

In [ ]:
?????

In [87]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -1.204461 -2.350369  1.974372 -2.404156
2013-01-02 -1.183173 -1.939512  0.478843  0.526254
2013-01-03  0.294057  1.891560  0.131653  2.854547
2013-01-04  0.798823 -0.398307 -0.198467 -0.570920
2013-01-05 -0.928408  0.047523  0.497456 -0.396819
2013-01-06 -0.317653  0.994635 -0.113912  0.818414

In [94]:
df.sort_values("A")

                   A         B         C         D
2013-01-01 -2.404156  1.974372 -2.350369 -1.204461
2013-01-04 -0.570920 -0.198467 -0.398307  0.798823
2013-01-05 -0.396819  0.497456  0.047523 -0.928408
2013-01-02  0.526254  0.478843 -1.939512 -1.183173
2013-01-06  0.818414 -0.113912  0.994635 -0.317653
2013-01-03  2.854547  0.131653  1.891560  0.294057

In [89]:
df.sort_values(["A", "B"])

                   A         B         C         D
2013-01-01 -2.404156  1.974372 -2.350369 -1.204461
2013-01-04 -0.570920 -0.198467 -0.398307  0.798823
2013-01-05 -0.396819  0.497456  0.047523 -0.928408
2013-01-02  0.526254  0.478843 -1.939512 -1.183173
2013-01-06  0.818414 -0.113912  0.994635 -0.317653
2013-01-03  2.854547  0.131653  1.891560  0.294057